CF/Catalogs/ПолитикиУчетаСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ПолитикиУчетаСерий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УказыватьПриОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриОтгрузкеВРозницу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриОтгрузкеКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриОтгрузкеКомплектовДляРазборки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриОтгрузкеКомплектующихДляСборки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриОтгрузкеПоВозвратуПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриОтгрузкеПоПеремещению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриОтраженииИзлишковНедостачПорчи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриПриемке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриПересчетеТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриПриемкеКомплектующихПослеРазборки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриПриемкеОтПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриПриемкеПоВозвратуОтКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриПриемкеПоПеремещению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриПриемкеСобранныхКомплектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьПриМаркировкеПродукцииДляГИСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/ПолитикиУчетаСерий/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	УстановитьДоступность(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УказыватьПриПриемкеПриИзменении(Элемент)
	Если Не Объект.УказыватьПриПриемке Тогда
		
		Объект.УказыватьПриПриемкеКомплектующихПослеРазборки = Ложь;
		Объект.УказыватьПриПриемкеОтПоставщика               = Ложь;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента        = Ложь ИЛИ Объект.УказыватьПриМаркировкеПродукцииДляГИСМ;
		Объект.УказыватьПриПриемкеПоПеремещению              = Ложь;
		Объект.УказыватьПриПриемкеСобранныхКомплектов        = Ложь;
		
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УказыватьПриОтгрузкеПриИзменении(Элемент)
	Если Не Объект.УказыватьПриОтгрузке Тогда
		
		Объект.УказыватьПриОтгрузкеКлиенту                = Ложь;
		Объект.УказыватьПриОтгрузкеВРозницу               = Ложь ИЛИ Объект.УказыватьПриМаркировкеПродукцииДляГИСМ;
		Объект.УказыватьПриОтгрузкеКомплектовДляРазборки  = Ложь;
		Объект.УказыватьПриОтгрузкеКомплектующихДляСборки = Ложь;
		Объект.УказыватьПриОтгрузкеПоВозвратуПоставщику   = Ложь;
		Объект.УказыватьПриОтгрузкеПоПеремещению          = Ложь;
		
		НастройкаУказанияСерийПриОтгрузке = 0;
	Иначе
		НастройкаУказанияСерийПриОтгрузке = 3;
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УказыватьПриМаркировкеПродукцииДляГИСМПриИзменении(Элемент)
	
	Если Объект.УказыватьПриМаркировкеПродукцииДляГИСМ Тогда
		
		Объект.УказыватьПриПриемкеОтПоставщика = Истина;
		Объект.УказыватьПриПриемкеПоВозвратуОтКлиента = Истина;
		Объект.УказыватьПриОтраженииИзлишковНедостачПорчи = Истина;
		Объект.УказыватьПриОтгрузкеВРозницу = Истина;
		
	КонецЕсли;
	
	УстановитьДоступнотьПоМаркировке(ЭтаФорма, Объект.УказыватьПриМаркировкеПродукцииДляГИСМ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик команды, создаваемой механизмом запрета редактирования ключевых реквизитов.
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ОбработкаОповещения = Новый ОписаниеОповещения("РазблокировкаРезвизитов", ЭтотОбъект);
		ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект, ОбработкаОповещения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступность(Форма)
	
	Форма.Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.Доступность        = Форма.Объект.УказыватьПриПриемке;
	Форма.Элементы.УказыватьПриПриемкеОтПоставщика.Доступность               = Форма.Объект.УказыватьПриПриемке;
	Форма.Элементы.УказыватьПриПриемкеПоПеремещению.Доступность              = Форма.Объект.УказыватьПриПриемке;
	Форма.Элементы.УказыватьПриПриемкеСобранныхКомплектов.Доступность        = Форма.Объект.УказыватьПриПриемке;
	Форма.Элементы.УказыватьПриПриемкеКомплектующихПослеРазборки.Доступность = Форма.Объект.УказыватьПриПриемке;
	
	Форма.Элементы.УказыватьПриОтгрузкеКлиенту.Доступность                = Форма.Объект.УказыватьПриОтгрузке;
	Форма.Элементы.УказыватьПриОтгрузкеВРозницу.Доступность               = Форма.Объект.УказыватьПриОтгрузке;
	Форма.Элементы.УказыватьПриОтгрузкеКомплектующихДляСборки.Доступность = Форма.Объект.УказыватьПриОтгрузке;
	Форма.Элементы.УказыватьПриОтгрузкеПоВозвратуПоставщику.Доступность   = Форма.Объект.УказыватьПриОтгрузке;
	Форма.Элементы.УказыватьПриОтгрузкеПоПеремещению.Доступность          = Форма.Объект.УказыватьПриОтгрузке;
	Форма.Элементы.УказыватьПриОтгрузкеКомплектовДляРазборки.Доступность  = Форма.Объект.УказыватьПриОтгрузке;
	
	Форма.Элементы.УказыватьПриОтраженииИзлишковНедостачПорчи.Доступность = Истина;
	Форма.Элементы.УказыватьПриПересчетеТоваров.Доступность               = Истина;
	Форма.Элементы.УказыватьПриПриемке.Доступность                        = Истина;
	Форма.Элементы.УказыватьПриОтгрузке.Доступность                       = Истина;
	
	УстановитьДоступнотьПоМаркировке(Форма, Форма.Объект.УказыватьПриМаркировкеПродукцииДляГИСМ);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступнотьПоМаркировке(Форма, УказыватьПриМаркировкеПродукцииДляГИСМ)
	
	Форма.Элементы.УказыватьПриПриемкеПоВозвратуОтКлиента.ТолькоПросмотр     = УказыватьПриМаркировкеПродукцииДляГИСМ;
	Форма.Элементы.УказыватьПриОтраженииИзлишковНедостачПорчи.ТолькоПросмотр = УказыватьПриМаркировкеПродукцииДляГИСМ;
	Форма.Элементы.УказыватьПриОтгрузкеВРозницу.ТолькоПросмотр               = УказыватьПриМаркировкеПродукцииДляГИСМ;
	
КонецПроцедуры

&НаКлиенте
Процедура РазблокировкаРезвизитов(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт
	
	УстановитьДоступнотьПоМаркировке(ЭтаФорма, Объект.УказыватьПриМаркировкеПродукцииДляГИСМ)
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
